app/controllers/api/benches_controller.rb

    def create
        @bench = Bench.new(bench_params)
        if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "walt disney family museum"], ["lat", 37.801631], ["lng", -122.458484], ["created_at", "2020-03-27 02:30:30.988759"], ["updated_at", "2020-03-27 02:30:30.988759"]]