app/controllers/application_controller.rb

    def current_user
        return nil unless session[:session_token]
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "RV24CycMzUVHHbp4Um-Hs9OdK-E"], ["LIMIT", 1]]