app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "max"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(20)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "JrVr6HsoeeZA2nD0QaKufLESSEk"], ["updated_at", "2020-03-25 02:47:33.679111"], ["id", 2]]